Internal Wave Tank 2024/openfoam code/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          84;
        startFace       32162;
    }
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          84;
        startFace       32246;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          304;
        startFace       32330;
    }
    atmosphere
    {
        type            patch;
        nFaces          196;
        startFace       32634;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          32496;
        startFace       32830;
    }
)

// ************************************************************************* //
